Revit 2026 API

# StairsRunLocationLineJustification Property

---

The position of the run relative to the Up-direction path used to create the run.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public StairsRunJustification LocationLineJustification { get; set; }
```
```vb
Public Property LocationLineJustification As StairsRunJustification
	Get
	Set
```
```cpp
public:
property StairsRunJustification LocationLineJustification {
	StairsRunJustification get ();
	void set (StairsRunJustification value);
}
```
```fsharp
member LocationLineJustification : StairsRunJustification with get, set
```

#### Property Value

StairsRunJustification

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | The stairs run is sketched so the data being set is not applicable. |

Only common runs(straight, spiral, winder) have location line justification.

#### Reference

StairsRun Class

Autodesk.Revit.DB.Architecture Namespace